# Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить, к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и dict.

# month = int(input("Введите число меясца от 1 до 12: "))
#
# months = {
#   1: "январь",
#   2: "февраль",
#   3: "март",
#   4: "апрель",
#   5: "май",
#   6: "июнь",
#   7: "июль",
#   8: "август",
#   9: "сентябрь",
#   10: "октябрь",
#   11: "ноябрь",
#   12: "декабрь",
# }
# seasons= {
#   1: "зима",
#   2: "зима",
#   3: "весна",
#   4: "весна",
#   5: "весна",
#   6: "лето",
#   7: "лето",
#   8: "лето",
#   9: "осень",
#   10: "осень",
#   11: "осень",
#   12: "зима"
# }
# a = months[month]
# b = seasons[month]
#
# print(b)


month = int(input("Введите число меясца от 1 до 12: "))

season = {
       1: ['Январь', 'Зима'],
       2: ['Февраль', 'Зима'],
       3: ['Март', 'Весна'],
       4: ['Апрель', 'Весна']
}

print(season[month][0], season[month][1])


